Repository: analogte/Vault
Catalog: secure_vault/lib/l10n/app_*.arb
Languages: id, ja, ko, th

# appTagline
source: Keep your files safe
id: Jaga file Anda dengan aman
ja: ファイルを安全に保護
ko: 파일을 안전하게 보호하세요
th: เก็บไฟล์ของคุณอย่างปลอดภัย

source: Loading...
id: Memuat...
ja: 読み込み中...
ko: 로딩 중...
th: กำลังโหลด...

# securityCheck
source: Checking security...
id: Memeriksa keamanan...
ja: セキュリティチェック中...
ko: 보안 확인 중...
th: ตรวจสอบความปลอดภัย...

# enterPin
source: Please enter PIN
id: Silakan masukkan PIN
ja: PINを入力してください
ko: PIN을 입력하세요
th: กรุณาใส่รหัส PIN

source: Entering app...
id: Memasuki aplikasi...
ja: アプリに入っています...
ko: 앱 진입 중...
th: กำลังเข้าสู่แอป...

source: Version
id: Versi
ja: バージョン
ko: 버전
th: เวอร์ชัน

source: Settings
id: Pengaturan
ja: 設定
ko: 설정
th: ตั้งค่า

source: Security
id: Keamanan
ja: セキュリティ
ko: 보안
th: ความปลอดภัย

source: Data
ja: データ
ko: 데이터
th: ข้อมูล

source: About
id: Tentang
ja: アプリについて
ko: 정보
th: เกี่ยวกับ

source: Account
id: Akun
ja: アカウント
ko: 계정
th: บัญชี

# biometricUnlock
source: Unlock with {type}
id: Buka kunci dengan {type}
ja: {type}でロック解除
ko: {type}으로 잠금 해제
th: ปลดล็อคด้วย {type}

# biometricSubtitle
source: Use fingerprint or Face ID to open Vault
id: Gunakan sidik jari atau Face ID untuk membuka Vault
ja: 指紋またはFace IDでボルトを開く
ko: 지문 또는 Face ID로 볼트 열기
th: ใช้ลายนิ้วมือหรือ Face ID เพื่อเปิด Vault

source: Auto Lock
id: Kunci Otomatis
ja: 自動ロック
ko: 자동 잠금
th: ล็อคอัตโนมัติ

# autoLockEnabled
source: Lock Vault after {time} of inactivity
id: Kunci Vault setelah {time} tidak aktif
ja: {time}無操作後にボルトをロック
ko: {time} 후 볼트 잠금
th: ล็อค Vault หลังจากไม่ใช้งาน {time}

# autoLockDisabled
source: Disabled
id: Dinonaktifkan
ja: 無効
ko: 비활성화됨
th: ปิดใช้งาน

source: Lock Timeout
id: Waktu Kunci
ja: ロックタイムアウト
ko: 잠금 시간
th: ระยะเวลาล็อค

source: Select auto lock timeout
id: Pilih waktu kunci otomatis
ja: 自動ロックタイムアウトを選択
ko: 자동 잠금 시간 선택
th: เลือกระยะเวลาล็อคอัตโนมัติ

# lockOnBackground
source: Lock when leaving app
id: Kunci saat keluar aplikasi
ja: バックグラウンドでロック
ko: 백그라운드에서 잠금
th: ล็อคเมื่อออกจากแอป

# lockOnBackgroundSubtitle
source: Lock Vault immediately when switching to another app
id: Kunci Vault segera saat beralih ke aplikasi lain
ja: 他のアプリに切り替えるとすぐにボルトをロック
ko: 다른 앱으로 전환 시 즉시 볼트 잠금
th: ล็อค Vault ทันทีเมื่อสลับไปใช้แอปอื่น

source: Screenshot Prevention
id: Cegah Screenshot
ja: スクリーンショット防止
ko: 스크린샷 방지
th: ป้องกันการ Screenshot

# screenshotPreventionSubtitle
source: Prevent screen capture in the app
id: Cegah pengambilan layar di aplikasi
ja: アプリ内でのスクリーンショットを防止
ko: 앱 내 스크린샷 방지
th: ป้องกันการจับภาพหน้าจอในแอป

# restartRequired
source: Changes will take effect after restart
id: Perubahan akan berlaku setelah restart
ja: 変更は再起動後に有効になります
ko: 변경사항은 재시작 후 적용됩니다
th: การเปลี่ยนแปลงจะมีผลหลังจากรีสตาร์ทแอป

# clipboardAutoClear
source: Auto Clear Clipboard
id: Hapus Clipboard Otomatis
ja: クリップボード自動クリア
ko: 클립보드 자동 삭제
th: ล้าง Clipboard อัตโนมัติ

# clipboardAutoClearEnabled
source: Clear clipboard after {seconds} seconds
id: Hapus clipboard setelah menyalin {seconds} detik
ja: コピー後{seconds}秒でクリップボードをクリア
ko: 복사 후 {seconds}초 후 클립보드 삭제
th: ล้าง Clipboard หลังคัดลอก {seconds} วินาที

# clipboardTimeout
source: Clipboard Clear Timeout
id: Waktu Hapus Clipboard
ja: クリップボードクリアタイムアウト
ko: 클립보드 삭제 시간
th: ระยะเวลาล้าง Clipboard

# selectClipboardTimeout
source: Select clipboard clear timeout
id: Pilih waktu hapus clipboard
ja: クリップボードクリアタイムアウトを選択
ko: 클립보드 삭제 시간 선택
th: เลือกระยะเวลาล้าง Clipboard

source: Security Status
id: Status Keamanan
ja: セキュリティ状態
ko: 보안 상태
th: สถานะความปลอดภัย

source: Device Status
id: Status Perangkat
ja: デバイス状態
ko: 기기 상태
th: สถานะอุปกรณ์

# deviceSecure
source: Device is secure
id: Perangkat aman
ja: デバイスは安全です
ko: 기기가 안전합니다
th: อุปกรณ์ปลอดภัย

# deviceRooted
source: Device is Rooted/Jailbroken
id: Perangkat telah di-Root/Jailbreak
ja: デバイスはRoot/脱獄されています
ko: 기기가 루팅/탈옥되었습니다
th: อุปกรณ์ถูก Root/Jailbreak

# developerModeEnabled
source: Developer Mode is enabled
id: Mode Pengembang aktif
ja: 開発者モードが有効です
ko: 개발자 모드가 활성화되어 있습니다
th: Developer Mode เปิดอยู่

source: Security Details
id: Detail Keamanan
ja: セキュリティ詳細
ko: 보안 세부정보
th: รายละเอียดความปลอดภัย

source: App Integrity
id: Integritas Aplikasi
ja: アプリの整合性
ko: 앱 무결성
th: ความสมบูรณ์ของแอป

# appIntegritySafe
source: App is running in a safe environment
id: Aplikasi berjalan di lingkungan aman
ja: アプリは安全な環境で実行されています
ko: 앱이 안전한 환경에서 실행 중입니다
th: แอปทำงานในสภาพแวดล้อมปลอดภัย

# appIntegrityWarnings
source: {count} warnings found
id: Ditemukan {count} peringatan
ja: {count}件の警告が見つかりました
ko: {count}개의 경고가 발견되었습니다
th: พบ {count} คำเตือน

# externalStorage
source: App installed on External Storage
id: Aplikasi terinstal di Penyimpanan Eksternal
ja: アプリが外部ストレージにインストールされています
ko: 앱이 외부 저장소에 설치됨
th: แอปติดตั้งบน External Storage

source: Detected
id: Terdeteksi
ja: 検出
ko: 감지됨
th: พบ

source: Not Detected
id: Tidak Terdeteksi
ja: 未検出
ko: 감지되지 않음
th: ไม่พบ

source: Warnings
id: Peringatan
ja: 警告
ko: 경고
th: คำเตือน

source: Trash
id: Sampah
ja: ゴミ箱
ko: 휴지통
th: ถังขยะ

# trashSubtitle
source: View and restore deleted files
id: Lihat dan pulihkan file yang dihapus
ja: 削除したファイルを表示・復元
ko: 삭제된 파일 보기 및 복원
th: ดูและกู้คืนไฟล์ที่ลบ

source: Backup
ja: バックアップ
ko: 백업
th: สำรองข้อมูล

# backupSubtitle
source: Export/Import all data
id: Ekspor/Impor semua data
ja: すべてのデータをエクスポート/インポート
ko: 모든 데이터 내보내기/가져오기
th: Export/Import ข้อมูลทั้งหมด

# versionInfo
source: Version
id: Versi
ja: バージョン
ko: 버전
th: เวอร์ชัน

source: Security Features
id: Fitur Keamanan
ja: セキュリティ機能
ko: 보안 기능
th: ฟีเจอร์ความปลอดภัย

# securityFeaturesSubtitle
source: AES-256-GCM + Argon2id (or PBKDF2)
id: AES-256-GCM + Argon2id (atau PBKDF2)
ja: AES-256-GCM + Argon2id（またはPBKDF2）
ko: AES-256-GCM + Argon2id (또는 PBKDF2)
th: AES-256-GCM + Argon2id (หรือ PBKDF2)

source: Privacy Policy
id: Kebijakan Privasi
ja: プライバシーポリシー
ko: 개인정보 보호정책
th: นโยบายความเป็นส่วนตัว

# privacyPolicySubtitle
source: Data is encrypted and stored locally only
id: Data dienkripsi dan disimpan secara lokal saja
ja: データは暗号化されローカルにのみ保存されます
ko: 데이터는 암호화되어 로컬에만 저장됩니다
th: ข้อมูลถูกเข้ารหัสและเก็บในเครื่องของคุณเท่านั้น

source: App Lock Settings
id: Pengaturan Kunci Aplikasi
ja: アプリロック設定
ko: 앱 잠금 설정
th: ตั้งค่าการล็อคแอป

source: PIN enabled
id: PIN aktif
ja: PIN有効
ko: PIN 활성화됨
th: เปิดใช้งาน PIN แล้ว

source: PIN not set
id: PIN belum diatur
ja: PIN未設定
ko: PIN 설정되지 않음
th: ยังไม่ได้ตั้งค่า PIN

source: Lock App Now
id: Kunci Aplikasi Sekarang
ja: 今すぐアプリをロック
ko: 지금 앱 잠금
th: ล็อคแอปตอนนี้

# lockAppNowSubtitle
source: Lock app and show PIN screen
id: Kunci aplikasi dan tampilkan layar PIN
ja: アプリをロックしてPIN画面を表示
ko: 앱을 잠그고 PIN 화면 표시
th: ล็อคแอปและแสดงหน้า PIN

source: Encryption
id: Enkripsi
ja: 暗号化
ko: 암호화
th: การเข้ารหัส

# encryptionAES
source: AES-256-GCM (Military grade)
id: AES-256-GCM (Standar militer)
ja: AES-256-GCM（軍事レベル）
ko: AES-256-GCM (군사 등급)
th: AES-256-GCM (มาตรฐานทหาร)

# encryptionArgon2
source: Argon2id Key Derivation (GPU attack resistant)
id: Argon2id Key Derivation (Tahan serangan GPU)
ja: Argon2idキー派生（GPU攻撃耐性）
ko: Argon2id 키 파생 (GPU 공격 저항)
th: Argon2id Key Derivation (ทนทานต่อ GPU attack)

# encryptionPBKDF2
source: PBKDF2 100,000 iterations (for legacy vaults)
id: PBKDF2 100.000 iterasi (untuk vault lama)
ja: PBKDF2 100,000回反復（レガシーボルト用）
ko: PBKDF2 100,000회 반복 (레거시 볼트용)
th: PBKDF2 100,000 iterations (สำหรับ vault เก่า)

source: Protection
id: Perlindungan
ja: 保護
ko: 보호
th: การป้องกัน

# protectionRoot
source: Root/Jailbreak detection
id: Deteksi Root/Jailbreak
ja: Root/脱獄検出
ko: 루팅/탈옥 감지
th: ตรวจจับ Root/Jailbreak

# protectionEmulator
source: Emulator and Debug mode detection
id: Deteksi Emulator dan mode Debug
ja: エミュレータとデバッグモード検出
ko: 에뮬레이터 및 디버그 모드 감지
th: ตรวจจับ Emulator และ Debug mode

# protectionScreenshot
source: Screenshot prevention
id: Cegah Screenshot
ja: スクリーンショット防止
ko: 스크린샷 방지
th: ป้องกันการ Screenshot

# protectionClipboard
source: Auto clipboard clear
id: Hapus Clipboard otomatis
ja: クリップボード自動クリア
ko: 클립보드 자동 삭제
th: ล้าง Clipboard อัตโนมัติ

# protectionBackground
source: Lock on background
id: Kunci saat di background
ja: バックグラウンドでロック
ko: 백그라운드에서 잠금
th: ล็อคเมื่อออกจากแอป

source: Storage
id: Penyimpanan
ja: ストレージ
ko: 저장소
th: การจัดเก็บ

# storageNoServer
source: No data sent to server
id: Data tidak dikirim ke server
ja: サーバーにデータを送信しません
ko: 서버로 데이터를 전송하지 않음
th: ไม่ส่งข้อมูลไปยัง server

source: Special Features
id: Fitur Khusus
ja: 特殊機能
ko: 특수 기능
th: ฟีเจอร์พิเศษ

# featureSecureKeyboard
source: Secure Keyboard (no logging)
id: Keyboard Aman (tanpa logging)
ja: セキュアキーボード（ログなし）
ko: 보안 키보드 (로깅 없음)
th: Secure Keyboard (ไม่บันทึกการพิมพ์)

# featureDecoyVault
source: Decoy Vault (fake vault)
id: Vault Palsu (vault tiruan)
ja: おとりボルト（偽のボルト）
ko: 가짜 볼트 (미끼 볼트)
th: Decoy Vault (vault ปลอม)

# privacyTitle
source: Privacy
id: Privasi
ja: プライバシー
ko: 개인정보
th: ความเป็นส่วนตัว

# privacyInfo1
source: All files are encrypted with AES-256-GCM
id: Semua file dienkripsi dengan AES-256-GCM
ja: すべてのファイルはAES-256-GCMで暗号化されています
ko: 모든 파일은 AES-256-GCM으로 암호화됩니다
th: ไฟล์ทั้งหมดถูกเข้ารหัสด้วย AES-256-GCM

# privacyInfo2
source: Passwords processed with PBKDF2 100,000 rounds
id: Password diproses dengan PBKDF2 100.000 putaran
ja: パスワードはPBKDF2で100,000回処理されます
ko: 비밀번호는 PBKDF2로 100,000회 처리됩니다
th: รหัสผ่านถูกประมวลผลด้วย PBKDF2 100,000 รอบ

# privacyInfo3
source: All data stored locally on your device only
id: Semua data disimpan di perangkat Anda saja
ja: すべてのデータはお使いのデバイスにのみ保存されます
ko: 모든 데이터는 기기에만 저장됩니다
th: ข้อมูลทั้งหมดเก็บในเครื่องของคุณเท่านั้น

# privacyInfo4
source: No data sent to server
id: Tidak ada data yang dikirim ke server
ja: サーバーにデータを送信しません
ko: 서버로 데이터를 전송하지 않습니다
th: ไม่มีการส่งข้อมูลไปยัง server

# privacyInfo5
source: No tracking or behavior analysis
id: Tidak ada pelacakan atau analisis perilaku
ja: トラッキングや行動分析はありません
ko: 추적이나 행동 분석이 없습니다
th: ไม่มีการติดตามหรือวิเคราะห์พฤติกรรม

# privacyInfo6
source: No ads
id: Tanpa iklan
ja: 広告なし
ko: 광고 없음
th: ไม่มีโฆษณา

# privacyWarning
source: If you forget your password, data cannot be recovered
id: Jika lupa password, data tidak dapat dipulihkan
ja: パスワードを忘れると、データを復元できません
ko: 비밀번호를 잊으면 데이터를 복구할 수 없습니다
th: หากลืมรหัสผ่าน จะไม่สามารถกู้คืนข้อมูลได้

source: Understood
id: Mengerti
ja: 理解しました
ko: 이해했습니다
th: เข้าใจแล้ว

source: Security Warning
id: Peringatan Keamanan
ja: セキュリティ警告
ko: 보안 경고
th: คำเตือนความปลอดภัย

# unsafeEnvironment
source: Potentially unsafe environment detected:
id: Lingkungan yang mungkin tidak aman terdeteksi:
ja: 安全でない可能性のある環境が検出されました：
ko: 안전하지 않을 수 있는 환경이 감지되었습니다:
th: ตรวจพบสภาพแวดล้อมที่อาจไม่ปลอดภัย:

# appStillUsable
source: App can still be used, but data may be at risk. Recommended to use on non-rooted/jailbroken device
id: Aplikasi masih dapat digunakan, tetapi data mungkin berisiko. Disarankan menggunakan di perangkat yang tidak di-root/jailbreak
ja: アプリは引き続き使用できますが、データにリスクがある可能性があります。 Root/脱獄されていないデバイスでの使用をお勧めします
ko: 앱은 계속 사용할 수 있지만 데이터가 위험에 처할 수 있습니다. 루팅/탈옥되지 않은 기기에서 사용하는 것이 좋습니다
th: แอปยังสามารถใช้งานได้ แต่ข้อมูลอาจมีความเสี่ยง แนะนำให้ใช้งานบนอุปกรณ์ที่ไม่ได้ Root/Jailbreak

source: Exit App
id: Keluar Aplikasi
ja: アプリを終了
ko: 앱 종료
th: ออกจากแอป

# continueAnyway
source: Continue
id: Lanjutkan
ja: 続行
ko: 계속
th: ดำเนินการต่อ

# seconds
source: {count} seconds
id: {count} detik
ja: {count}秒
ko: {count}초
th: {count} วินาที

# minutes
source: {count} minutes
id: {count} menit
ja: {count}分
ko: {count}분
th: {count} นาที

# hours
source: {count} hours
id: {count} jam
ja: {count}時間
ko: {count}시간
th: {count} ชั่วโมง

source: Close
id: Tutup
ja: 閉じる
ko: 닫기
th: ปิด

source: Cancel
id: Batal
ja: キャンセル
ko: 취소
th: ยกเลิก

source: OK
ko: 확인
th: ตกลง

source: Save
id: Simpan
ja: 保存
ko: 저장
th: บันทึก

source: Delete
id: Hapus
ja: 削除
ko: 삭제
th: ลบ

source: Confirm
id: Konfirmasi
ja: 確認
ko: 확인
th: ยืนยัน

source: Share
id: Bagikan
ja: 共有
ko: 공유
th: แชร์

source: Restore
id: Pulihkan
ja: 復元
ko: 복원
th: กู้คืน

source: PIN Lock
id: Kunci PIN
ja: PINロック
ko: PIN 잠금
th: ล็อค PIN

source: Enter PIN to unlock
id: Masukkan PIN untuk membuka kunci
ja: PINを入力してロック解除
ko: PIN을 입력하여 잠금 해제
th: ใส่ PIN เพื่อปลดล็อค

source: Enter current PIN
id: Masukkan PIN saat ini
ja: 現在のPINを入力
ko: 현재 PIN 입력
th: ใส่ PIN ปัจจุบัน

source: Enter new PIN
id: Masukkan PIN baru
ja: 新しいPINを入力
ko: 새 PIN 입력
th: ใส่ PIN ใหม่

source: Confirm new PIN
id: Konfirmasi PIN baru
ja: 新しいPINを確認
ko: 새 PIN 확인
th: ยืนยัน PIN ใหม่

source: Create PIN
id: Buat PIN
ja: PINを作成
ko: PIN 만들기
th: สร้าง PIN

source: Change PIN
id: Ubah PIN
ja: PINを変更
ko: PIN 변경
th: เปลี่ยน PIN

source: Wrong PIN
id: PIN salah
ja: PINが間違っています
ko: PIN이 틀렸습니다
th: PIN ไม่ถูกต้อง

# pinMismatch
source: PINs do not match
id: PIN tidak cocok
ja: PINが一致しません
ko: PIN이 일치하지 않습니다
th: PIN ไม่ตรงกัน

# pinChanged
source: PIN changed successfully
id: PIN berhasil diubah
ja: PINが変更されました
ko: PIN이 변경되었습니다
th: เปลี่ยน PIN สำเร็จ

# pinCreated
source: PIN created successfully
id: PIN berhasil dibuat
ja: PINが作成されました
ko: PIN이 생성되었습니다
th: สร้าง PIN สำเร็จ

source: Forgot PIN?
id: Lupa PIN?
ja: PINを忘れた？
ko: PIN을 잊으셨나요?
th: ลืม PIN?

# useBiometric
source: Use {type}
id: Gunakan {type}
ja: {type}を使用
ko: {type} 사용
th: ใช้ {type}

# attemptsRemaining
source: {count} attempts remaining
id: Sisa {count} percobaan
ja: 残り{count}回
ko: {count}회 남음
th: เหลืออีก {count} ครั้ง

# tooManyAttempts
source: Too many failed attempts
id: Terlalu banyak percobaan gagal
ja: 試行回数が多すぎます
ko: 시도 횟수가 너무 많습니다
th: ลองผิดมากเกินไป

# tryAgainIn
source: Try again in {seconds} seconds
id: Coba lagi dalam {seconds} detik
ja: {seconds}秒後に再試行してください
ko: {seconds}초 후 다시 시도하세요
th: ลองใหม่ใน {seconds} วินาที

source: Enable App Lock
id: Aktifkan Kunci Aplikasi
ja: アプリロックを有効にする
ko: 앱 잠금 활성화
th: เปิดใช้งานล็อคแอป

# enableAppLockSubtitle
source: Require PIN when opening app
id: Memerlukan PIN saat membuka aplikasi
ja: アプリを開くときにPINが必要
ko: 앱을 열 때 PIN 필요
th: ต้องใส่ PIN เมื่อเปิดแอป

source: Biometric for App Lock
id: Biometrik untuk Kunci Aplikasi
ja: アプリロック用生体認証
ko: 앱 잠금용 생체 인식
th: ไบโอเมตริกสำหรับล็อคแอป

# biometricForAppLockSubtitle
source: Use {type} instead of PIN
id: Gunakan {type} sebagai pengganti PIN
ja: PINの代わりに{type}を使用
ko: PIN 대신 {type} 사용
th: ใช้ {type} แทน PIN

source: Auto Lock Timeout
id: Waktu Kunci Otomatis
ja: 自動ロックタイムアウト
ko: 자동 잠금 시간
th: ระยะเวลาล็อคอัตโนมัติ

# lockAfterBackground
source: Lock after {time} in background
id: Kunci setelah {time} di background
ja: バックグラウンドで{time}後にロック
ko: 백그라운드 {time} 후 잠금
th: ล็อคหลังจากอยู่ในพื้นหลัง {time}

source: Immediately
id: Segera
ja: すぐに
ko: 즉시
th: ทันที

source: Setup PIN
id: Atur PIN
ja: PINを設定
ko: PIN 설정
th: ตั้งค่า PIN

source: Reset PIN
ja: PINをリセット
ko: PIN 재설정
th: รีเซ็ต PIN

# setPinFirst
source: Please set PIN first
id: Silakan atur PIN terlebih dahulu
ja: 先にPINを設定してください
ko: 먼저 PIN을 설정하세요
th: กรุณาตั้งค่า PIN ก่อน

# backupTitle
source: Backup Data
ja: データバックアップ
ko: 데이터 백업
th: สำรองข้อมูล

# backupInfo
source: About Backup
id: Tentang Backup
ja: バックアップについて
ko: 백업 정보
th: เกี่ยวกับการสำรองข้อมูล

# backupInfo1
source: Backup file includes all Vaults, Folders and files
id: File backup mencakup semua Vault, Folder dan file
ja: バックアップファイルにはすべてのボルト、フォルダ、ファイルが含まれます
ko: 백업 파일에는 모든 볼트, 폴더 및 파일이 포함됩니다
th: ไฟล์ Backup จะรวม Vaults, Folders และไฟล์ทั้งหมด

# backupInfo2
source: Files remain encrypted, safe to share to Cloud
id: File tetap terenkripsi, aman untuk dibagikan ke Cloud
ja: ファイルは暗号化されたままなので、クラウドに共有しても安全です
ko: 파일은 암호화된 상태로 유지되어 클라우드에 공유해도 안전합니다
th: ไฟล์ยังคงเข้ารหัสอยู่ ปลอดภัยแม้แชร์ไป Cloud

# backupInfo3
source: Can set additional password for security
id: Dapat mengatur password tambahan untuk keamanan
ja: セキュリティのために追加のパスワードを設定できます
ko: 보안을 위해 추가 비밀번호를 설정할 수 있습니다
th: สามารถตั้งรหัสผ่านเพิ่มเติมเพื่อความปลอดภัย

# backupInfo4
source: Recommended to backup regularly
id: Disarankan untuk backup secara teratur
ja: 定期的なバックアップをお勧めします
ko: 정기적으로 백업하는 것이 좋습니다
th: แนะนำให้สำรองข้อมูลเป็นประจำ

source: Create Backup
id: Buat Backup
ja: バックアップを作成
ko: 백업 만들기
th: สร้าง Backup

source: Set Backup Password
id: Atur Password Backup
ja: バックアップパスワードを設定
ko: 백업 비밀번호 설정
th: ตั้งรหัสผ่าน Backup

# setBackupPasswordSubtitle
source: Encrypt backup file with additional password
id: Enkripsi file backup dengan password tambahan
ja: 追加のパスワードでバックアップファイルを暗号化
ko: 추가 비밀번호로 백업 파일 암호화
th: เข้ารหัสไฟล์ backup ด้วยรหัสผ่านเพิ่มเติม

source: Password
ja: パスワード
ko: 비밀번호
th: รหัสผ่าน

# enterBackupPassword
source: Enter password for backup
id: Masukkan password untuk backup
ja: バックアップ用パスワードを入力
ko: 백업 비밀번호 입력
th: ใส่รหัสผ่านสำหรับ backup

source: Creating...
id: Membuat...
ja: 作成中...
ko: 생성 중...
th: กำลังสร้าง...

source: Restore from Backup
id: Pulihkan dari Backup
ja: バックアップから復元
ko: 백업에서 복원
th: กู้คืนจาก Backup

# selectBackupFile
source: Select .svbackup file to restore
id: Pilih file .svbackup untuk dipulihkan
ja: .svbackupファイルを選択して復元
ko: .svbackup 파일을 선택하여 복원
th: เลือกไฟล์ .svbackup เพื่อกู้คืน

# duplicateVaultWarning
source: If restored Vault has same name as existing, it will be skipped
id: Jika Vault yang dipulihkan memiliki nama yang sama dengan yang ada, akan dilewati
ja: 復元するボルトが既存のものと同名の場合、そのボルトはスキップされます
ko: 복원하는 볼트가 기존 볼트와 이름이 같으면 건너뜁니다
th: หาก Vault ที่กู้คืนมีชื่อซ้ำกับที่มีอยู่ ระบบจะข้ามการกู้คืน vault นั้น

# selectBackupFileButton
source: Select Backup File
id: Pilih File Backup
ja: バックアップファイルを選択
ko: 백업 파일 선택
th: เลือกไฟล์ Backup

source: Restoring...
id: Memulihkan...
ja: 復元中...
ko: 복원 중...
th: กำลังกู้คืน...

# backupCreatedSuccess
source: Backup Created Successfully!
id: Backup Berhasil Dibuat!
ja: バックアップ作成成功！
ko: 백업 생성 완료!
th: สร้าง Backup สำเร็จ!

source: Files
id: File
ja: ファイル
ko: 파일
th: ไฟล์

source: Folders
id: Folder
ja: フォルダ
ko: 폴더
th: โฟลเดอร์

source: File Size
id: Ukuran File
ja: ファイルサイズ
ko: 파일 크기
th: ขนาดไฟล์

# selectSaveMethod
source: Select how to save backup file:
id: Pilih cara menyimpan file backup:
ja: バックアップファイルの保存方法を選択：
ko: 백업 파일 저장 방법 선택:
th: เลือกวิธีบันทึกไฟล์ backup:

# restoreSuccess
source: Restore Successful!
id: Pemulihan Berhasil!
ja: 復元成功！
ko: 복원 완료!
th: กู้คืนสำเร็จ!

source: Vaults restored
id: Vault dipulihkan
ja: 復元されたボルト
ko: 복원된 볼트
th: Vaults ที่กู้คืน

source: Files restored
id: File dipulihkan
ja: 復元されたファイル
ko: 복원된 파일
th: ไฟล์ที่กู้คืน

source: Folders restored
id: Folder dipulihkan
ja: 復元されたフォルダ
ko: 복원된 폴더
th: โฟลเดอร์ที่กู้คืน

# enterBackupPasswordPrompt
source: Enter Backup Password
id: Masukkan Password Backup
ja: バックアップパスワードを入力
ko: 백업 비밀번호 입력
th: ใส่รหัสผ่าน Backup

# backupInfoTitle
source: Backup Info
id: Info Backup
ja: バックアップ情報
ko: 백업 정보
th: ข้อมูล Backup

source: Created at
id: Dibuat pada
ja: 作成日時
ko: 생성 시간
th: สร้างเมื่อ

source: Device
id: Perangkat
ja: デバイス
ko: 기기
th: อุปกรณ์

source: Vault count
id: Jumlah Vault
ja: ボルト数
ko: 볼트 수
th: จำนวน Vault

source: File count
id: Jumlah File
ja: ファイル数
ko: 파일 수
th: จำนวนไฟล์

source: Folder count
id: Jumlah Folder
ja: フォルダ数
ko: 폴더 수
th: จำนวนโฟลเดอร์

# passwordProtected
source: Password
ja: パスワード
ko: 비밀번호
th: รหัสผ่าน

source: Yes
id: Ada
ja: あり
ko: 있음
th: มี

source: No
id: Tidak ada
ja: なし
ko: 없음
th: ไม่มี

# duplicateSkipped
source: Duplicate Vault will be skipped
id: Vault dengan nama sama akan dilewati
ja: 同名のボルトはスキップされます
ko: 이름이 같은 볼트는 건너뜁니다
th: Vault ที่มีชื่อซ้ำจะถูกข้าม

source: No Vaults to backup
id: Tidak ada Vault untuk dibackup
ja: バックアップするボルトがありません
ko: 백업할 볼트가 없습니다
th: ไม่มี Vault ที่จะ backup

# backupFailed
source: Backup creation failed
id: Pembuatan backup gagal
ja: バックアップ作成失敗
ko: 백업 생성 실패
th: การสร้าง backup ล้มเหลว

# fileNotFound
source: Backup file not found
id: File backup tidak ditemukan
ja: バックアップファイルが見つかりません
ko: 백업 파일을 찾을 수 없습니다
th: ไม่พบไฟล์ backup

# wrongPasswordOrCorrupt
source: Wrong password or file is corrupted
id: Password salah atau file rusak
ja: パスワードが間違っているかファイルが破損しています
ko: 비밀번호가 틀리거나 파일이 손상되었습니다
th: รหัสผ่านไม่ถูกต้องหรือไฟล์เสียหาย

# backupCorruptOrNeedsPassword
source: Backup file corrupted or needs password
id: File backup rusak atau memerlukan password
ja: バックアップファイルが破損しているかパスワードが必要です
ko: 백업 파일이 손상되었거나 비밀번호가 필요합니다
th: ไฟล์ backup เสียหายหรือต้องใส่รหัสผ่าน

# invalidBackupNoMetadata
source: Invalid backup file (no metadata)
id: File backup tidak valid (tidak ada metadata)
ja: 無効なバックアップファイル（メタデータなし）
ko: 유효하지 않은 백업 파일 (메타데이터 없음)
th: ไฟล์ backup ไม่ถูกต้อง (ไม่พบ metadata)

# invalidBackupNoVaults
source: Invalid backup file (no vaults data)
id: File backup tidak valid (tidak ada data vault)
ja: 無効なバックアップファイル（ボルトデータなし）
ko: 유효하지 않은 백업 파일 (볼트 데이터 없음)
th: ไฟล์ backup ไม่ถูกต้อง (ไม่พบข้อมูล vaults)

# invalidBackupNoFiles
source: Invalid backup file (no files data)
id: File backup tidak valid (tidak ada data file)
ja: 無効なバックアップファイル（ファイルデータなし）
ko: 유효하지 않은 백업 파일 (파일 데이터 없음)
th: ไฟล์ backup ไม่ถูกต้อง (ไม่พบข้อมูล files)

# backupNeedsPassword
source: This backup requires password
id: Backup ini memerlukan password
ja: このバックアップにはパスワードが必要です
ko: 이 백업에는 비밀번호가 필요합니다
th: ไฟล์ backup นี้ต้องใส่รหัสผ่าน

source: Restore failed
id: Pemulihan gagal
ja: 復元失敗
ko: 복원 실패
th: การ restore ล้มเหลว

# vaultReplaced
source: Vault "{name}" was replaced
id: Vault "{name}" diganti
ja: ボルト「{name}」が置き換えられました
ko: 볼트 "{name}"이(가) 대체되었습니다
th: Vault "{name}" ถูกแทนที่

# vaultSkipped
source: Skipped Vault "{name}" as it already exists
id: Melewati Vault "{name}" karena sudah ada
ja: ボルト「{name}」は既に存在するためスキップされました
ko: 볼트 "{name}"이(가) 이미 존재하여 건너뛰었습니다
th: ข้าม Vault "{name}" เนื่องจากมีอยู่แล้ว

# folderSkippedNoVault
source: Skipped folder as vault not found
id: Melewati folder karena vault tidak ditemukan
ja: ボルトが見つからないためフォルダがスキップされました
ko: 볼트를 찾을 수 없어 폴더를 건너뛰었습니다
th: ข้าม folder เนื่องจากไม่พบ vault

# fileSkippedNoVault
source: Skipped file as vault not found
id: Melewati file karena vault tidak ditemukan
ja: ボルトが見つからないためファイルがスキップされました
ko: 볼트를 찾을 수 없어 파일을 건너뛰었습니다
th: ข้าม file เนื่องจากไม่พบ vault

# encryptedFileNotFound
source: Encrypted file not found for file ID {id}
id: File terenkripsi untuk ID {id} tidak ditemukan
ja: ファイルID {id}の暗号化ファイルが見つかりません
ko: 파일 ID {id}의 암호화된 파일을 찾을 수 없습니다
th: ไม่พบไฟล์ encrypted สำหรับ file ID {id}

# passwordMinLength
source: Password must be at least 4 characters
id: Password minimal 4 karakter
ja: パスワードは4文字以上必要です
ko: 비밀번호는 최소 4자 이상이어야 합니다
th: รหัสผ่านต้องมีอย่างน้อย 4 ตัวอักษร

source: Please enter password
id: Silakan masukkan password
ja: パスワードを入力してください
ko: 비밀번호를 입력하세요
th: กรุณาใส่รหัสผ่าน

# fileSaved
source: File saved successfully
id: File berhasil disimpan
ja: ファイルが保存されました
ko: 파일이 저장되었습니다
th: บันทึกไฟล์สำเร็จ

# preparing
source: Preparing data...
id: Menyiapkan data...
ja: データを準備中...
ko: 데이터 준비 중...
th: กำลังเตรียมข้อมูล...

source: Creating backup file...
id: Membuat file backup...
ja: バックアップファイルを作成中...
ko: 백업 파일 생성 중...
th: กำลังสร้างไฟล์ backup...

source: Backing up vaults...
id: Membackup vault...
ja: ボルトをバックアップ中...
ko: 볼트 백업 중...
th: กำลัง backup vaults...

source: Backing up file data...
id: Membackup data file...
ja: ファイルデータをバックアップ中...
ko: 파일 데이터 백업 중...
th: กำลัง backup ข้อมูลไฟล์...

source: Backing up encrypted files...
id: Membackup file terenkripsi...
ja: 暗号化ファイルをバックアップ中...
ko: 암호화된 파일 백업 중...
th: กำลัง backup encrypted files...

# backingUpFile
source: Backing up file ({current}/{total})...
id: Membackup file ({current}/{total})...
ja: ファイルをバックアップ中（{current}/{total}）...
ko: 파일 백업 중 ({current}/{total})...
th: กำลัง backup ไฟล์ ({current}/{total})...

# compressing
source: Compressing data...
id: Mengompresi data...
ja: データを圧縮中...
ko: 데이터 압축 중...
th: กำลังบีบอัดข้อมูล...

# encrypting
source: Encrypting backup...
id: Mengenkripsi backup...
ja: バックアップを暗号化中...
ko: 백업 암호화 중...
th: กำลังเข้ารหัส backup...

source: Done!
id: Selesai!
ja: 完了！
ko: 완료!
th: เสร็จสิ้น!

# readingBackup
source: Reading backup file...
id: Membaca file backup...
ja: バックアップファイルを読み込み中...
ko: 백업 파일 읽는 중...
th: กำลังอ่านไฟล์ backup...

# decrypting
source: Decrypting backup...
id: Mendekripsi backup...
ja: バックアップを復号化中...
ko: 백업 복호화 중...
th: กำลังถอดรหัส backup...
