Repository: analogte/Vault
Catalog: secure_vault/lib/l10n/app_*.arb
Languages: id, ja, ko, th

source: Large File Warning
th: คำเตือนไฟล์ขนาดใหญ่

# largeFileWarningMessage
source: You selected {count} file(s) larger than {size}. Large files require significant RAM and may cause the app to crash.
th: คุณเลือก {count} ไฟล์ที่มีขนาดใหญ่กว่า {size} ไฟล์ขนาดใหญ่ต้องใช้ RAM มาก และอาจทำให้แอปค้างหรือปิดตัว

# largeFilesList
source: Large files:
th: ไฟล์ขนาดใหญ่:

# estimatedRamUsage
source: Estimated RAM usage: {size}
th: RAM ที่ต้องใช้โดยประมาณ: {size}

source: Proceed Anyway
th: ดำเนินการต่อ

# removeAndContinue
source: Remove Large Files
th: ลบไฟล์ใหญ่ออก

# skipLargeFiles
source: Skip large files and continue with smaller ones
th: ข้ามไฟล์ใหญ่และอัปโหลดเฉพาะไฟล์เล็ก

# deleteOriginalTitle
source: Delete Original Files?
th: ลบไฟล์ต้นฉบับ?

# deleteOriginalMessage
source: Successfully uploaded {count} file(s). Would you like to delete the original files from your device to save storage space?
th: อัปโหลด {count} ไฟล์สำเร็จ คุณต้องการลบไฟล์ต้นฉบับจากเครื่องเพื่อประหยัดพื้นที่หรือไม่?

# deleteOriginalWarning
source: This will permanently delete the original files from your gallery/folder.
th: การดำเนินการนี้จะลบไฟล์ต้นฉบับจากแกลเลอรี/โฟลเดอร์อย่างถาวร

source: Keep Originals
th: เก็บไว้

source: Delete Originals
th: ลบต้นฉบับ

# originalsDeleted
source: {count} original file(s) deleted
th: ลบไฟล์ต้นฉบับ {count} ไฟล์แล้ว

# originalsDeleteFailed
source: Could not delete some original files
th: ไม่สามารถลบไฟล์ต้นฉบับบางไฟล์ได้

source: Take Video
th: ถ่ายวิดีโอ

source: Recent Files
th: ไฟล์ล่าสุด

source: File opened
th: เปิดไฟล์แล้ว

source: Theme
th: ธีม

# themeSystem
source: System
th: ตามระบบ

# themeLight
source: Light
th: สว่าง

# themeDark
source: Dark
th: มืด

source: Select Theme
th: เลือกธีม

source: Theme changed
th: เปลี่ยนธีมแล้ว

source: Storage Stats
th: สถิติพื้นที่จัดเก็บ

source: By Category
th: ตามประเภท

source: Images
th: รูปภาพ

source: Videos
th: วิดีโอ

source: Documents
th: เอกสาร

source: Audio
th: เสียง

source: Other
th: อื่นๆ

source: Total Files
th: ไฟล์ทั้งหมด

source: Total Size
th: ขนาดทั้งหมด

source: Tags
th: แท็ก

source: Manage Tags
th: จัดการแท็ก

source: Create Tag
th: สร้างแท็ก

source: Tag Name
th: ชื่อแท็ก

source: Select Color
th: เลือกสี

source: Tag created
th: สร้างแท็กแล้ว

source: Tag deleted
th: ลบแท็กแล้ว

# noTags
source: No tags yet
th: ยังไม่มีแท็ก

source: Filter by Tag
th: กรองตามแท็ก

# appName
source: Secure Vault
ja: セキュアボルト
ko: 시큐어 볼트

source: Root/Jailbreak
ja: Root/脱獄
ko: 루팅/탈옥

source: Developer Mode
id: Mode Pengembang
ja: 開発者モード
ko: 개발자 모드

source: Emulator
ja: エミュレータ
ko: 에뮬레이터

source: Debug Mode
id: Mode Debug
ja: デバッグモード
ko: 디버그 모드

# storageKeystore
source: Hardware Keystore (Android/iOS)
ja: ハードウェアキーストア（Android/iOS）
ko: 하드웨어 키스토어 (Android/iOS)

# storageEncrypted
source: Encrypted Shared Preferences
ja: 暗号化された共有設定
ko: 암호화된 공유 환경설정

# featureObfuscation
source: Code Obfuscation
id: Obfuskasi Kode
ja: コード難読化
ko: 코드 난독화

source: Vaults
id: Vault
ja: ボルト
ko: 볼트

source: Decoy Vault
id: Vault Palsu
ja: おとりボルト
ko: 가짜 볼트
