Repository: analogte/Vault
Catalog: secure_vault/lib/l10n/app_*.arb
Languages: id, ja, ko, th

# extracting
source: Extracting files...
id: Mengekstrak file...
ja: ファイルを展開中...
ko: 파일 추출 중...
th: กำลังแตกไฟล์...

source: Restoring vaults...
id: Memulihkan vault...
ja: ボルトを復元中...
ko: 볼트 복원 중...
th: กำลัง restore vaults...

source: Restoring folders...
id: Memulihkan folder...
ja: フォルダを復元中...
ko: 폴더 복원 중...
th: กำลัง restore folders...

source: Restoring files...
id: Memulihkan file...
ja: ファイルを復元中...
ko: 파일 복원 중...
th: กำลัง restore files...

# restoringFile
source: Restoring file ({current}/{total})...
id: Memulihkan file ({current}/{total})...
ja: ファイルを復元中（{current}/{total}）...
ko: 파일 복원 중 ({current}/{total})...
th: กำลัง restore ไฟล์ ({current}/{total})...

# vaultList
source: My Vaults
id: Vault Saya
ja: マイボルト
ko: 내 볼트
th: Vaults ของฉัน

source: Create Vault
id: Buat Vault
ja: ボルトを作成
ko: 볼트 만들기
th: สร้าง Vault

source: Open Vault
id: Buka Vault
ja: ボルトを開く
ko: 볼트 열기
th: เปิด Vault

source: Delete Vault
id: Hapus Vault
ja: ボルトを削除
ko: 볼트 삭제
th: ลบ Vault

source: Vault Name
id: Nama Vault
ja: ボルト名
ko: 볼트 이름
th: ชื่อ Vault

source: Vault Password
id: Password Vault
ja: ボルトパスワード
ko: 볼트 비밀번호
th: รหัสผ่าน Vault

source: Confirm Password
id: Konfirmasi Password
ja: パスワードを確認
ko: 비밀번호 확인
th: ยืนยันรหัสผ่าน

# enterVaultName
source: e.g. Personal Files, Photos
id: Masukkan nama vault
ja: ボルト名を入力
ko: 볼트 이름 입력
th: เช่น ไฟล์ส่วนตัว, รูปภาพ

source: Enter vault password
id: Masukkan password vault
ja: ボルトパスワードを入力
ko: 볼트 비밀번호 입력
th: ใส่รหัสผ่าน vault

# passwordMismatch
source: Passwords do not match
id: Password tidak cocok
ja: パスワードが一致しません
ko: 비밀번호가 일치하지 않습니다
th: รหัสผ่านไม่ตรงกัน

# vaultCreated
source: Vault created successfully
id: Vault berhasil dibuat
ja: ボルトが作成されました
ko: 볼트가 생성되었습니다
th: สร้าง Vault สำเร็จ

# vaultDeleted
source: Vault deleted successfully
id: Vault berhasil dihapus
ja: ボルトが削除されました
ko: 볼트가 삭제되었습니다
th: ลบ Vault สำเร็จ

# enterPasswordToOpen
source: Enter password to open vault
id: Masukkan password untuk membuka vault
ja: パスワードを入力してボルトを開く
ko: 비밀번호를 입력하여 볼트 열기
th: ใส่รหัสผ่านเพื่อเปิด vault

source: Wrong password
id: Password salah
ja: パスワードが間違っています
ko: 비밀번호가 틀렸습니다
th: รหัสผ่านไม่ถูกต้อง

# noVaults
source: No vaults yet
id: Belum ada vault
ja: ボルトがまだありません
ko: 볼트가 없습니다
th: ยังไม่มี vault

# createFirstVault
source: Create your first vault to get started
id: Buat vault pertama Anda untuk memulai
ja: 最初のボルトを作成して始めましょう
ko: 첫 번째 볼트를 만들어 시작하세요
th: สร้าง vault แรกของคุณเพื่อเริ่มต้น

source: Please enter vault name
th: กรุณากรอกชื่อ Vault

# vaultNameMinLength
source: Vault name must be at least 2 characters
th: ชื่อ Vault ต้องมีอย่างน้อย 2 ตัวอักษร

# vaultNameMaxLength
source: Vault name must not exceed 50 characters
th: ชื่อ Vault ต้องไม่เกิน 50 ตัวอักษร

# passwordMinLengthHint
source: At least 8 characters
th: อย่างน้อย 8 ตัวอักษร

# passwordMinLength8
source: Password must be at least 8 characters
th: รหัสผ่านต้องมีอย่างน้อย 8 ตัวอักษร

# passwordMaxLength
source: Password must not exceed 128 characters
th: รหัสผ่านต้องไม่เกิน 128 ตัวอักษร

source: Please confirm password
th: กรุณายืนยันรหัสผ่าน

# vaultPasswordWarning
source: Important: Remember your password well. If you forget it, files cannot be recovered.
th: สำคัญ: จำรหัสผ่านให้ดี หากลืมรหัสผ่านจะไม่สามารถกู้คืนไฟล์ได้

# vaultCreationTimeout
source: Vault creation took too long. Please try again.
th: การสร้าง Vault ใช้เวลานานเกินไป กรุณาลองใหม่อีกครั้ง

# vaultCreationError
source: Error creating vault
th: เกิดข้อผิดพลาดในการสร้าง Vault

# directoryCreationError
source: Cannot create folder. Please check access permissions.
th: ไม่สามารถสร้างโฟลเดอร์ได้ กรุณาตรวจสอบสิทธิ์การเข้าถึง

# databaseError
source: Database error. Please try again.
th: เกิดข้อผิดพลาดในการบันทึกข้อมูล กรุณาลองใหม่อีกครั้ง

# networkError
source: Cannot connect to server. Please check your internet connection.
th: ไม่สามารถเชื่อมต่อกับเซิร์ฟเวอร์ได้ กรุณาตรวจสอบการเชื่อมต่ออินเทอร์เน็ต

source: File Manager
id: Manajer File
ja: ファイルマネージャー
ko: 파일 관리자
th: จัดการไฟล์

source: Add Files
id: Tambah File
ja: ファイルを追加
ko: 파일 추가
th: เพิ่มไฟล์

source: Add Images
id: Tambah Gambar
ja: 画像を追加
ko: 이미지 추가
th: เพิ่มรูปภาพ

source: Take Photo
id: Ambil Foto
ja: 写真を撮る
ko: 사진 찍기
th: ถ่ายรูป

source: Create Folder
id: Buat Folder
ja: フォルダを作成
ko: 폴더 만들기
th: สร้างโฟลเดอร์

source: Folder Name
id: Nama Folder
ja: フォルダ名
ko: 폴더 이름
th: ชื่อโฟลเดอร์

source: Enter folder name
id: Masukkan nama folder
ja: フォルダ名を入力
ko: 폴더 이름 입력
th: ใส่ชื่อโฟลเดอร์

# folderCreated
source: Folder created successfully
id: Folder berhasil dibuat
ja: フォルダが作成されました
ko: 폴더가 생성되었습니다
th: สร้างโฟลเดอร์สำเร็จ

source: Delete Folder
id: Hapus Folder
ja: フォルダを削除
ko: 폴더 삭제
th: ลบโฟลเดอร์

# folderDeleted
source: Folder deleted successfully
id: Folder berhasil dihapus
ja: フォルダが削除されました
ko: 폴더가 삭제되었습니다
th: ลบโฟลเดอร์สำเร็จ

source: Move to Folder
id: Pindahkan ke Folder
ja: フォルダに移動
ko: 폴더로 이동
th: ย้ายไปโฟลเดอร์

source: Root
ja: ルート
ko: 루트
th: หน้าหลัก

source: Move to
id: Pindahkan ke
ja: 移動先
ko: 이동
th: ย้ายไป

# movedToFolder
source: Moved to folder successfully
id: Berhasil dipindahkan ke folder
ja: フォルダに移動しました
ko: 폴더로 이동했습니다
th: ย้ายไปโฟลเดอร์สำเร็จ

source: Search
id: Cari
ja: 検索
ko: 검색
th: ค้นหา

source: Search files...
id: Cari file...
ja: ファイルを検索...
ko: 파일 검색...
th: ค้นหาไฟล์...

source: No files found
id: File tidak ditemukan
ja: ファイルが見つかりません
ko: 파일을 찾을 수 없습니다
th: ไม่พบไฟล์

source: No folders found
id: Folder tidak ditemukan
ja: フォルダが見つかりません
ko: 폴더를 찾을 수 없습니다
th: ไม่พบโฟลเดอร์

source: Sort by
id: Urutkan
ja: 並び替え
ko: 정렬
th: เรียงตาม

# sortNewest
source: Newest
id: Terbaru
ja: 新しい順
ko: 최신순
th: ล่าสุด

# sortOldest
source: Oldest
id: Terlama
ja: 古い順
ko: 오래된 순
th: เก่าสุด

# sortNameAZ
source: Name A-Z
id: Nama A-Z
ja: 名前 A-Z
ko: 이름 A-Z
th: ชื่อ ก-ฮ

# sortNameZA
source: Name Z-A
id: Nama Z-A
ja: 名前 Z-A
ko: 이름 Z-A
th: ชื่อ ฮ-ก

# sortSizeSmall
source: Size: Smallest
id: Ukuran: Terkecil
ja: サイズ：小さい順
ko: 크기: 작은 순
th: ขนาด: เล็กสุด

# sortSizeLarge
source: Size: Largest
id: Ukuran: Terbesar
ja: サイズ：大きい順
ko: 크기: 큰 순
th: ขนาด: ใหญ่สุด

source: Filter by
id: Filter
ja: フィルター
ko: 필터
th: กรองตาม

# filterAll
source: All
id: Semua
ja: すべて
ko: 전체
th: ทั้งหมด

# filterImages
source: Images
id: Gambar
ja: 画像
ko: 이미지
th: รูปภาพ

# filterDocuments
source: Documents
id: Dokumen
ja: ドキュメント
ko: 문서
th: เอกสาร

# filterVideos
source: Videos
id: Video
ja: 動画
ko: 동영상
th: วิดีโอ

# filterAudio
source: Audio
ja: 音声
ko: 오디오
th: เสียง

source: Select All
id: Pilih Semua
ja: すべて選択
ko: 전체 선택
th: เลือกทั้งหมด

source: Deselect All
id: Batalkan Pilihan
ja: 選択解除
ko: 선택 해제
th: ยกเลิกทั้งหมด

# selectedCount
source: {count} selected
id: {count} dipilih
ja: {count}件選択
ko: {count}개 선택됨
th: เลือก {count} รายการ

source: Delete Selected
id: Hapus Terpilih
ja: 選択を削除
ko: 선택 삭제
th: ลบที่เลือก

source: Move Selected
id: Pindahkan Terpilih
ja: 選択を移動
ko: 선택 이동
th: ย้ายที่เลือก

source: Download Selected
id: Unduh Terpilih
ja: 選択をダウンロード
ko: 선택 다운로드
th: ดาวน์โหลดที่เลือก

source: File deleted
id: File dihapus
ja: ファイルが削除されました
ko: 파일이 삭제되었습니다
th: ลบไฟล์แล้ว

source: File restored
id: File dipulihkan
ja: ファイルが復元されました
ko: 파일이 복원되었습니다
th: กู้คืนไฟล์แล้ว

source: Moved to trash
id: Dipindahkan ke sampah
ja: ゴミ箱に移動しました
ko: 휴지통으로 이동했습니다
th: ย้ายไปถังขยะแล้ว

# permanentDelete
source: Permanently Delete
id: Hapus Permanen
ja: 完全に削除
ko: 영구 삭제
th: ลบถาวร

# permanentDeleteWarning
source: This action cannot be undone. The file will be permanently deleted.
id: Tindakan ini tidak dapat dibatalkan. File akan dihapus secara permanen.
ja: この操作は元に戻せません。ファイルは完全に削除されます。
ko: 이 작업은 취소할 수 없습니다. 파일이 영구적으로 삭제됩니다.
th: การดำเนินการนี้ไม่สามารถย้อนกลับได้ ไฟล์จะถูกลบถาวร

# daysRemaining
source: {count} days remaining
id: Tersisa {count} hari
ja: 残り{count}日
ko: {count}일 남음
th: เหลืออีก {count} วัน

source: Empty Trash
id: Kosongkan Sampah
ja: ゴミ箱を空にする
ko: 휴지통 비우기
th: ล้างถังขยะ

# emptyTrashWarning
source: This will permanently delete all files in trash. This action cannot be undone.
id: Ini akan menghapus semua file di sampah secara permanen. Tindakan ini tidak dapat dibatalkan.
ja: これによりゴミ箱内のすべてのファイルが完全に削除されます。この操作は元に戻せません。
ko: 휴지통의 모든 파일이 영구적으로 삭제됩니다. 이 작업은 취소할 수 없습니다.
th: นี่จะลบไฟล์ทั้งหมดในถังขยะอย่างถาวร การดำเนินการนี้ไม่สามารถย้อนกลับได้

# trashEmpty
source: Trash is empty
id: Sampah kosong
ja: ゴミ箱は空です
ko: 휴지통이 비어 있습니다
th: ถังขยะว่างเปล่า

source: Restore All
id: Pulihkan Semua
ja: すべて復元
ko: 전체 복원
th: กู้คืนทั้งหมด

# allRestored
source: All files restored
id: Semua file dipulihkan
ja: すべてのファイルが復元されました
ko: 모든 파일이 복원되었습니다
th: กู้คืนไฟล์ทั้งหมดแล้ว

source: Trash emptied
id: Sampah dikosongkan
ja: ゴミ箱が空になりました
ko: 휴지통이 비워졌습니다
th: ล้างถังขยะแล้ว

source: File Details
id: Detail File
ja: ファイル詳細
ko: 파일 세부정보
th: รายละเอียดไฟล์

source: File Name
id: Nama File
ja: ファイル名
ko: 파일 이름
th: ชื่อไฟล์

source: File Type
id: Tipe File
ja: ファイルタイプ
ko: 파일 유형
th: ประเภทไฟล์

source: Created
id: Dibuat
ja: 作成日
ko: 생성일
th: สร้างเมื่อ

source: Modified
id: Diubah
ja: 更新日
ko: 수정일
th: แก้ไขเมื่อ

source: Size
id: Ukuran
ja: サイズ
ko: 크기
th: ขนาด

source: Download
id: Unduh
ja: ダウンロード
ko: 다운로드
th: ดาวน์โหลด

source: Download complete
id: Unduhan selesai
ja: ダウンロード完了
ko: 다운로드 완료
th: ดาวน์โหลดสำเร็จ

# decoyVaultSubtitle
source: Create a fake vault with different password
id: Buat vault palsu dengan password berbeda
ja: 別のパスワードで偽のボルトを作成
ko: 다른 비밀번호로 가짜 볼트 만들기
th: สร้าง vault ปลอมด้วยรหัสผ่านต่างกัน

source: Decoy Vault enabled
id: Vault Palsu aktif
ja: おとりボルト有効
ko: 가짜 볼트 활성화됨
th: เปิดใช้งาน Decoy Vault แล้ว

# decoyVaultPassword
source: Decoy Password
id: Password Palsu
ja: おとりパスワード
ko: 가짜 비밀번호
th: รหัสผ่าน Decoy

# decoyVaultInfo
source: Enter decoy password to open fake vault
id: Masukkan password palsu untuk membuka vault palsu
ja: おとりパスワードを入力して偽のボルトを開く
ko: 가짜 비밀번호를 입력하여 가짜 볼트 열기
th: ใส่รหัสผ่าน decoy เพื่อเปิด vault ปลอม

# decoyVaultWhatIs
source: What is Decoy Vault?
th: Decoy Vault คืออะไร?

# decoyVaultDescription
source: Decoy Vault is a security feature that helps protect your data in case you are forced to open your Vault. - Set a fake password (Decoy Password) - When entering the fake password, it shows a fake Vault with unimportant data - Your real password still opens the real Vault normally
th: Decoy Vault เป็นฟีเจอร์ความปลอดภัยที่ช่วยปกป้องข้อมูลของคุณ ในกรณีที่ถูกบังคับให้เปิด Vault - ตั้งรหัสผ่านปลอม (Decoy Password) - เมื่อใส่รหัสปลอม จะแสดง Vault ปลอมที่มีข้อมูลไม่สำคัญ - รหัสผ่านจริงยังคงเปิด Vault จริงได้ตามปกติ

source: Current Status
th: สถานะปัจจุบัน

# decoyVaultActive
source: Decoy Vault is active
th: Decoy Vault เปิดใช้งานแล้ว

# decoyVaultNotSet
source: Decoy Vault not set up
th: ยังไม่ได้ตั้งค่า Decoy Vault

source: Setup Decoy Password
th: ตั้งค่า Decoy Password

# decoyPasswordHint
source: This password will open the fake Vault
th: รหัสผ่านนี้จะใช้เปิด Vault ปลอม

source: Enter decoy password
th: ใส่รหัสผ่านปลอม

source: Confirm Decoy Password
th: ยืนยัน Decoy Password

source: Enter decoy password again
th: ใส่รหัสผ่านปลอมอีกครั้ง

source: Setup Decoy Vault
th: ตั้งค่า Decoy Vault

# decoyPasswordWarning
source: Do not use the same password as your real Vault!
th: อย่าใช้รหัสผ่านเดียวกับ Vault จริง!

source: Enable Decoy Vault
th: เปิดใช้งาน Decoy Vault

source: Decoy password will work
th: Decoy password จะใช้งานได้

source: Decoy password will not work
th: Decoy password จะไม่ทำงาน

source: Change Decoy Password
th: เปลี่ยน Decoy Password

source: Set new decoy password
th: ตั้งรหัสผ่านปลอมใหม่

source: Delete Decoy Vault
th: ลบ Decoy Vault

# deleteDecoyVaultSubtitle
source: Delete decoy password and fake vault
th: ลบรหัสผ่านปลอมและ Vault ปลอม

source: How to Use
th: วิธีใช้งาน

# decoyStep1
source: When opening Vault, enter decoy password instead of real password
th: เมื่อเปิด Vault ใส่รหัสผ่านปลอมแทนรหัสจริง

# decoyStep2
source: System will open Decoy Vault with fake data
th: ระบบจะเปิด Decoy Vault ที่มีข้อมูลปลอม

# decoyStep3
source: Use real password to open real Vault
th: ใช้รหัสผ่านจริงเพื่อเปิด Vault จริง

source: Confirm Delete
th: ยืนยันการลบ

# deleteDecoyVaultConfirm
source: Do you want to delete Decoy Vault? All data in Decoy Vault will be deleted.
th: คุณต้องการลบ Decoy Vault หรือไม่? ข้อมูลใน Decoy Vault จะถูกลบทั้งหมด

# decoyVaultSetupSuccess
source: Decoy Vault setup successful
th: ตั้งค่า Decoy Vault สำเร็จ

# decoyVaultDeleteSuccess
source: Decoy Vault deleted successfully
th: ลบ Decoy Vault สำเร็จ

# passwordChangedSuccess
source: Password changed successfully
th: เปลี่ยนรหัสผ่านสำเร็จ

source: New Password
th: รหัสผ่านใหม่

source: Language
id: Bahasa
ja: 言語
ko: 언어
th: ภาษา

source: Select Language
id: Pilih Bahasa
ja: 言語を選択
ko: 언어 선택
th: เลือกภาษา

source: Language changed
id: Bahasa diubah
ja: 言語が変更されました
ko: 언어가 변경되었습니다
th: เปลี่ยนภาษาแล้ว

source: Error
ja: エラー
ko: 오류
th: ข้อผิดพลาด

# errorOccurred
source: An error occurred
id: Terjadi kesalahan
ja: エラーが発生しました
ko: 오류가 발생했습니다
th: เกิดข้อผิดพลาด

source: Try Again
id: Coba Lagi
ja: 再試行
ko: 다시 시도
th: ลองอีกครั้ง

source: Success
id: Berhasil
ja: 成功
ko: 성공
th: สำเร็จ

# biometricFingerprint
source: Fingerprint
id: Sidik Jari
ja: 指紋
ko: 지문
th: ลายนิ้วมือ

# biometricIris
source: Iris
ja: 虹彩
ko: 홍채
th: ม่านตา

# biometricGeneric
source: Biometric
id: Biometrik
ja: 生体認証
ko: 생체 인식
th: ไบโอเมตริก

source: Unlock
id: Buka Kunci
ja: ロック解除
ko: 잠금 해제
th: ปลดล็อค

# setupPinTitle
source: Setup PIN
id: Atur PIN
ja: PINを設定
ko: PIN 설정
th: ตั้งค่า PIN

# confirmPinTitle
source: Confirm PIN
id: Konfirmasi PIN
ja: PINを確認
ko: PIN 확인
th: ยืนยัน PIN

# confirmNewPinTitle
source: Confirm New PIN
id: Konfirmasi PIN Baru
ja: 新しいPINを確認
ko: 새 PIN 확인
th: ยืนยัน PIN ใหม่

# enterCurrentPinTitle
source: Enter Current PIN
id: Masukkan PIN Saat Ini
ja: 現在のPINを入力
ko: 현재 PIN 입력
th: ใส่ PIN ปัจจุบัน

source: Verify Identity
id: Verifikasi Identitas
ja: 本人確認
ko: 본인 확인
th: ยืนยันตัวตน

# enter6DigitPinToUnlock
source: Enter 6-digit PIN to open the app
id: Masukkan PIN 6 digit untuk membuka aplikasi
ja: 6桁のPINを入力してアプリを開く
ko: 앱을 열려면 6자리 PIN을 입력하세요
th: ใส่รหัส PIN 6 หลักเพื่อเปิดแอป

# enter6DigitPinToSetup
source: Create a 6-digit PIN for security
id: Buat PIN 6 digit untuk keamanan
ja: セキュリティのために6桁のPINを作成
ko: 보안을 위해 6자리 PIN을 만드세요
th: สร้างรหัส PIN 6 หลักเพื่อความปลอดภัย

source: Enter PIN again to confirm
id: Masukkan PIN lagi untuk konfirmasi
ja: 確認のためPINを再入力
ko: 확인을 위해 PIN을 다시 입력하세요
th: ใส่รหัส PIN อีกครั้งเพื่อยืนยัน

source: Enter new PIN again
id: Masukkan PIN baru lagi
ja: 新しいPINを再入力
ko: 새 PIN을 다시 입력하세요
th: ใส่รหัส PIN ใหม่อีกครั้ง

source: Enter your current PIN
id: Masukkan PIN Anda saat ini
ja: 現在のPINを入力してください
ko: 현재 PIN을 입력하세요
th: ใส่รหัส PIN ปัจจุบันของคุณ

source: Enter PIN to continue
id: Masukkan PIN untuk melanjutkan
ja: 続行するにはPINを入力
ko: 계속하려면 PIN을 입력하세요
th: ใส่รหัส PIN เพื่อดำเนินการต่อ

# pinSetupSuccess
source: PIN setup successful
id: PIN berhasil diatur
ja: PIN設定完了
ko: PIN 설정 완료
th: ตั้งค่า PIN สำเร็จ

# pinSetupFailed
source: Unable to setup PIN
id: Tidak dapat mengatur PIN
ja: PINを設定できませんでした
ko: PIN을 설정할 수 없습니다
th: ไม่สามารถตั้งค่า PIN ได้

# pinUsedToUnlock
source: PIN will be used to unlock the app
id: PIN akan digunakan untuk membuka aplikasi
ja: PINはアプリのロック解除に使用されます
ko: PIN은 앱 잠금 해제에 사용됩니다
th: PIN จะถูกใช้เพื่อปลดล็อคแอปทุกครั้ง

# waitMinutes
source: Wait {minutes} minutes then try again
id: Tunggu {minutes} menit lalu coba lagi
ja: {minutes}分待ってから再試行してください
ko: {minutes}분 후에 다시 시도하세요
th: รอ {minutes} นาที แล้วลองใหม่

# authenticationSection
source: Authentication
th: การยืนยันตัวตน

# appProtected
source: App is protected
th: แอปได้รับการปกป้อง

# appNotLocked
source: App is not locked
th: แอปยังไม่ได้ล็อค

source: Your data is safe
th: ข้อมูลของคุณปลอดภัย

source: Setup PIN for security
th: ตั้งค่า PIN เพื่อความปลอดภัย

# create6DigitPin
source: Create 6-digit PIN to lock app
th: สร้างรหัส PIN 6 หลักเพื่อล็อคแอป

source: PIN is set
th: PIN ถูกตั้งค่าแล้ว

# appWillBeLocked
source: App will be locked on every open
th: แอปจะถูกล็อคทุกครั้งที่เปิด

source: Enabled
th: เปิดใช้งาน

source: Disable App Lock
th: ปิดการล็อคแอป

# disableAppLockConfirm
source: Disable App Lock?
th: ปิดการล็อคแอป?

# disableAppLockWarning
source: Disabling app lock will allow anyone to access your data. Are you sure?
th: การปิดการล็อคแอปจะทำให้ทุกคนสามารถเข้าถึงข้อมูลในแอปได้ คุณแน่ใจหรือไม่?

source: Disable Lock
th: ปิดการล็อค

source: App lock disabled
th: ปิดการล็อคแอปแล้ว

source: Enter PIN to confirm
th: ใส่ PIN เพื่อยืนยัน

source: Verify Current PIN
th: ยืนยัน PIN เดิม

source: Enter current PIN to change
th: ใส่ PIN ปัจจุบันเพื่อเปลี่ยน

source: Set New PIN
th: ตั้ง PIN ใหม่

# createNew6DigitPin
source: Create a new 6-digit PIN
th: สร้างรหัส PIN 6 หลักใหม่

# verifyPinTitle
source: Verify PIN
th: ยืนยัน PIN

# enterPinToDisableLock
source: Enter PIN to disable app lock
th: ใส่ PIN เพื่อปิดการล็อคแอป

# unlockAppWith
source: Unlock app with {type}
th: ปลดล็อคแอปด้วย {type}

# enableBiometricToUnlock
source: Enable {type} to unlock app
th: เปิดใช้ {type} เพื่อปลดล็อคแอป

# biometricEnabled
source: {type} enabled
th: เปิดใช้ {type} แล้ว

# lockAfterInactivity
source: Lock app after {time} of inactivity
th: ล็อคแอปหลังไม่ใช้งาน {time}

# selectLockAfter
source: Lock after
th: ล็อคอัตโนมัติหลังจาก

source: Security Tips
th: เคล็ดลับความปลอดภัย

# securityTip1
source: Use a unique PIN not used in other apps
th: ใช้ PIN ที่ไม่ซ้ำกับแอปอื่น

# securityTip2
source: Avoid easy PINs like 123456
th: หลีกเลี่ยง PIN ที่เดาง่าย เช่น 123456

# securityTip3
source: Enable Biometric for convenience
th: เปิดใช้ Biometric เพื่อความสะดวก

# securityTip4
source: Set auto lock for better security
th: ตั้งค่าล็อคอัตโนมัติเพื่อความปลอดภัย

# authenticateToEnable
source: Authenticate to enable {type}
th: ยืนยันตัวตนเพื่อเปิดใช้ {type}

# biometricAuthFailed
source: Authentication failed
th: การยืนยันตัวตนล้มเหลว

source: Biometric Settings
th: ตั้งค่า Biometric

# biometricEnabledForVault
source: {type} is enabled
th: {type} เปิดใช้งานอยู่

source: For this vault
th: สำหรับ Vault นี้

source: Disable Biometric
th: ปิดใช้งาน Biometric

source: Require password every time
th: ต้องใช้รหัสผ่านทุกครั้ง

source: Biometric disabled
th: ปิดใช้งาน Biometric แล้ว

# enableBiometricQuestion
source: Enable Biometric?
th: เปิดใช้งาน Biometric?

# enableBiometricDescription
source: Do you want to use {type} to unlock this vault next time? You can still use password as usual.
th: ต้องการใช้ {type} เพื่อปลดล็อค Vault นี้ในครั้งถัดไปหรือไม่? คุณยังสามารถใช้รหัสผ่านได้เหมือนเดิม

# doNotUse
source: Don't use
th: ไม่ใช้

source: Enable
th: เปิดใช้งาน

# biometricAvailableHint
source: {type} is available
th: {type} พร้อมใช้งาน

# biometricFirstTimeHint
source: Open vault with password first, then you will be asked to enable it
th: เปิด Vault ด้วยรหัสผ่านครั้งแรก แล้วระบบจะถามว่าต้องการเปิดใช้งานหรือไม่

# orDivider
source: or
th: หรือ

# upgradeSecurityTitle
source: Security Upgrade
th: อัปเกรดความปลอดภัย

# upgradeSecurityDescription
source: This vault uses PBKDF2 which is an older standard. Recommend upgrading to Argon2id which:
th: Vault นี้ใช้ PBKDF2 ซึ่งเป็นมาตรฐานเก่า แนะนำให้อัปเกรดเป็น Argon2id ซึ่ง:

# gpuAttackResistant
source: Resistant to GPU attacks
th: ทนทานต่อการโจมตีด้วย GPU

# asicAttackResistant
source: Resistant to ASIC attacks
th: ทนทานต่อการโจมตีด้วย ASIC

source: Latest security standard
th: มาตรฐานความปลอดภัยล่าสุด

# passwordRemainsNote
source: Note: Password will remain the same
th: หมายเหตุ: รหัสผ่านจะยังคงเหมือนเดิม

# upgradeLater
source: Later
th: ไว้ทีหลัง

# upgradeNow
source: Upgrade
th: อัปเกรด

# upgradingProgress
source: Upgrading...
th: กำลังอัปเกรด...

# upgradeToArgon2idSuccess
source: Upgraded to Argon2id successfully
th: อัปเกรดเป็น Argon2id สำเร็จ

# upgradeToArgon2idFailed
source: Upgrade failed
th: อัปเกรดล้มเหลว

# openVaultButton
source: Open Vault
th: เปิด Vault

# onboardingWelcome
source: Welcome to
th: ยินดีต้อนรับสู่

# onboardingGetStarted
source: Get Started
th: เริ่มต้นใช้งาน

# onboardingFeature1Title
source: Military-Grade Encryption
th: เข้ารหัสระดับทหาร

# onboardingFeature1Desc
source: All files are encrypted with AES-256. Even we cannot access your data.
th: ไฟล์ทุกไฟล์ถูกเข้ารหัส AES-256 แม้แต่เราก็ไม่สามารถเข้าถึงข้อมูลของคุณได้

# onboardingFeature2Title
source: Stored Locally Only
th: เก็บในเครื่องเท่านั้น

# onboardingFeature2Desc
source: No data is sent to any server. Your data stays only on your device.
th: ไม่มีการส่งข้อมูลไปยังเซิร์ฟเวอร์ ข้อมูลอยู่ในเครื่องของคุณเท่านั้น

# onboardingFeature3Title
source: Multi-Layer Protection
th: ปกป้องหลายชั้น

# onboardingFeature3Desc
source: PIN, Biometric, and Screenshot prevention.
th: PIN, ไบโอเมตริก และ ป้องกันการแคปหน้าจอ

# onboardingFeature4Title
source: Easy Management
th: จัดการง่าย

# onboardingFeature4Desc
source: Create multiple vaults, each with its own password.
th: สร้างตู้เซฟได้หลายอัน แต่ละอันมีรหัสผ่านแยกกัน

# onboardingSecurityWarningTitle
source: Please Read Carefully
th: กรุณาอ่านให้เข้าใจ

# onboardingNoRecovery
source: No Password Recovery
th: ไม่มีระบบกู้รหัสผ่าน

# onboardingNoRecoveryDesc
source: If you forget your PIN or Vault password, your data cannot be recovered.
th: หากคุณลืมรหัส PIN หรือรหัส Vault ข้อมูลจะไม่สามารถกู้คืนได้อีก

# onboardingRecommendations
source: Recommendations:
th: คำแนะนำ:

# onboardingRecommend1
source: Write down your passwords and keep them safe
th: จดรหัสผ่านเก็บไว้ในที่ปลอดภัย

# onboardingRecommend2
source: Use passwords you can remember
th: ใช้รหัสผ่านที่คุณจำได้

# onboardingRecommend3
source: Backup your data regularly
th: สำรองข้อมูลเป็นประจำ

# onboardingUnderstandRisk
source: I understand and accept this risk
th: ฉันเข้าใจและยอมรับความเสี่ยงนี้

# onboardingTermsTitle
source: Terms of Service
th: ข้อตกลงการใช้งาน

# onboardingTerms1
source: All data is encrypted and stored locally only
th: ข้อมูลทั้งหมดถูกเข้ารหัสและเก็บในเครื่องเท่านั้น

# onboardingTerms2
source: We do not store your passwords
th: เราไม่เก็บรหัสผ่านของคุณ

# onboardingTerms3
source: If you forget your password, we cannot help recover your data
th: หากลืมรหัสผ่าน เราไม่สามารถช่วยกู้คืนข้อมูลได้

# onboardingTerms4
source: You are responsible for remembering your passwords
th: คุณมีหน้าที่รับผิดชอบในการจำรหัสผ่านของคุณ

# onboardingTerms5
source: Regular backups are recommended
th: แนะนำให้สำรองข้อมูลเป็นประจำ

# onboardingAcceptTerms
source: Accept Terms
th: ยอมรับข้อตกลง

# onboardingAcceptPrivacy
source: Accept Privacy Policy
th: ยอมรับนโยบายความเป็นส่วนตัว

# onboardingAcceptAndContinue
source: Accept and Continue
th: ยอมรับและดำเนินการต่อ

# onboardingSetupPinTitle
source: Setup PIN
th: ตั้งค่า PIN

# onboardingSetupPinDesc
source: This PIN will be used to open the app every time.
th: PIN นี้จะใช้เปิดแอปทุกครั้งที่เข้าใช้งาน

# onboardingEnter6DigitPin
source: Enter 6-digit PIN
th: กรอก PIN 6 หลัก

# onboardingConfirmPinDesc
source: Enter PIN again to confirm
th: กรอก PIN อีกครั้งเพื่อยืนยัน

# onboardingBiometricTitle
source: Enable {type}?
th: เปิดใช้ {type}?

# onboardingBiometricDesc
source: Use {type} instead of PIN for convenience. (You still need to remember your PIN for emergencies)
th: ใช้ {type} แทน PIN เพื่อความสะดวก (คุณยังต้องจำ PIN ไว้เผื่อกรณีฉุกเฉิน)

# onboardingEnableBiometric
source: Enable {type}
th: เปิดใช้ {type}

# onboardingSkipForNow
source: Skip for now
th: ข้ามไปก่อน

# onboardingCompleteTitle
source: All Set!
th: พร้อมใช้งานแล้ว!

# onboardingCompleteTip1
source: Create your first Vault to start storing files
th: สร้าง Vault แรกเพื่อเริ่มเก็บไฟล์

# onboardingCompleteTip2
source: Each Vault has its own separate password
th: แต่ละ Vault มีรหัสผ่านแยกกัน

# onboardingCompleteTip3
source: You can backup your data in Settings
th: สำรองข้อมูลได้ในหน้าตั้งค่า

# onboardingStartUsing
source: Start Using
th: เริ่มต้นใช้งาน

# onboardingTips
source: Tips:
th: เคล็ดลับ:

source: Next
th: ถัดไป

source: Skip
th: ข้าม

source: Back
th: กลับ
